Repository: 84000/data-translation-memory
Catalog: toh231-v1.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་ཀྱི་ཞིང་གཅིག་ནས་ཀྱང་མི་གཡོ་ལ། སངས་རྒྱས་ཀྱི་ཞིང་དུ་མར་ཡང་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་སྐོར་རོ།
en: Without moving from one given buddha realm, they turn the wheel of Dharma in numerous buddha realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་གཅིག་ནས་ཀྱང་མི་གཡོ་ལ། སངས་རྒྱས་ཀྱི་ཞིང་དུ་མར་ཡང་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་སྣང་ངོ་།
en: Without moving from one given buddha realm, they appear to pass beyond suffering in numerous buddha realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་གཅིག་ནས་ཀྱང་མི་གཡོ་ལ། སངས་རྒྱས་ཀྱི་ཞིང་དུ་མར་ཡང་སེམས་ཅན་འདུལ་བ་ཇི་སྙེད་པ་ལ་དེ་སྙེད་ཀྱི་སྤྲུལ་པ་འགྱེད་ཀྱང་
en: Without moving from one given buddha realm, they send forth emanations into numerous buddha realms, training as many sentient beings as there are to train.

source: དེ་དག་སྤྲུལ་པ་འགྱེད་པའི་ཚེ། རྟོག་པ་མེད་ཅིང་རྣམ་པར་རྟོག་པ་མེད་པ་ཡིན་ནོ།
en: As they send forth emanations in this way, no thoughts or concepts are involved.”

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་གང་ལྟ་བུར་བྱང་ཆུབ་སེམས་དཔའ་སྤྲུལ་པ་འགྱེད་ན་མི་རྟོག་རྣམ་པར་མི་རྟོག་པ་ལགས།
en: “Blessed One, how can it be that when bodhisattvas send forth emanations they do so without the involvement of thoughts or concepts?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དེའི་ཕྱིར་དཔེ་ཉོན་ཅིག
en: “Noble son,” the Blessed One replied, “listen here to why that is.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ཉི་མ་དང་ཟླ་བ་ནི་གླིང་བཞིར་སྣང་བར་བྱེད་ཅིང་སེམས་ཅན་རྣམས་ལ་ཕན་འདོགས་པ་ཡིན་ཀྱང་།
en: Take, noble son, the analogy of the sun and moon that illuminate the four continents, benefiting sentient beings.

source: ཉི་མ་དང་ཟླ་བ་ནི་བདག་ཅག་གིས་སྣང་བར་བྱའོ། །བདག་ཅག་ནི་སེམས་ཅན་ལ་ཕན་འདོགས་པའོ་ཞེས་མི་རྟོག་རྣམ་པར་མི་རྟོག་མོད་ཀྱི།
en: Neither the sun nor the moon thinks, ‘I shall shine! I shall benefit sentient beings!’

source: འོན་ཀྱང་སྔོན་གྱི་ལས་རྣམ་པར་སྨིན་པའི་མངོན་པར་འདུ་བྱེད་པས་ཟླ་བ་དང་ཉི་མ་གཉིས་ཀྱི་བྱ་བ་དེ་ལྟ་བུ་འབྱུང་ངོ་།
en: Still, due to the formations of the ripening of past karmic actions, the sun and the moon come to perform such functions.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་སྤྲུལ་པ་འགྱེད་ན་མི་རྟོག་རྣམ་པར་མི་རྟོག་སྟེ། བསྒྲིམ་པའམ། མངོན་པར་འདུ་བྱ་བ་མི་བྱེད་དོ།
en: Noble son, it is a similar case when bodhisattvas send forth emanations without the use of thoughts or concepts, without having to apply themselves, and without having to create anything.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་སྔོན་གྱི་ལས་རྣམ་པར་སྨིན་པས་མངོན་པར་འདུ་བྱ་བ་རྣམས་མངོན་པར་གྲུབ་པའི་ཕྱིར་ཏེ།
en: In what way is this similar? It is because here too things are formed and done by the ripening of past karmic actions.

source: སྔོན་གྱི་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ།
en: That is to say, when bodhisattvas in the past engaged in bodhisattva activities,

source: དེ་ཅི་ནས་ཀྱང་རྣམ་པར་རྟོག་པ་མེད་པར་ཡང་སྤྲུལ་པ་རྣམས་འབྱུང་བར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་སྨོན་ལམ་བཏབ།
en: they made the prayer, ‘May I by all means become able to bring forth emanations nonconceptually.’

source: དེ་ལྟ་དེ་ལྟར་མངོན་པར་འདུས་བྱས་པའི་ཕྱིར་རོ།
en: Thus such specific karmic formations were created.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སྤྲུལ་པ་ལ་མཁས་པ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess ten such qualities have expertise regarding emanations.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas endowed with ten qualities quickly awaken to unexcelled and perfect buddhahood.

source: སྦྱིན་པ་ཤིན་ཏུ་གྲུབ་པས་སྦྱིན་པ་ཤིན་ཏུ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན།
en: utterly perfect generosity due to generosity having been accomplished completely;

source: ཚུལ་ཁྲིམས་ཤིན་ཏུ་གྲུབ་ཅིང་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་སྐྱོན་མེད་པ་དང་། མ་འདྲེས་པ་དང་། མ་འབགས་པ་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ལས་འདས་པ། ཡོངས་སུ་དག་པ། ཡོངས་སུ་བྱང་བ་དང་ལྡན་པས་ཚུལ་ཁྲིམས་ཤིན་ཏུ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན།
en: utterly perfect discipline, since discipline has been completely accomplished and the aggregate of discipline has become flawless, uncorrupted, undefiled, beyond hearers and solitary buddhas, completely pure, and purified;

source: བཟོད་པ་ཤིན་ཏུ་ཕུན་སུམ་ཚོགས་པ་རྣམས་དང་། བརྩོན་འགྲུས་ཤིན་ཏུ་ཕུན་སུམ་ཚོགས་པ་རྣམས་དང་། བསམ་གཏན་ཤིན་ཏུ་ཕུན་སུམ་ཚོགས་པ་རྣམས་དང་། ཤེས་རབ་ཤིན་ཏུ་ཕུན་སུམ་ཚོགས་པ་རྣམས་དང་། ཐབས་ཤིན་ཏུ་ཕུན་སུམ་ཚོགས་པ་རྣམས་དང་། སྨོན་ལམ་ཤིན་ཏུ་ཕུན་སུམ་ཚོགས་པ་རྣམས་དང་། སྟོབས་ཤིན་ཏུ་ཕུན་སུམ་ཚོགས་པ་རྣམས་དང་། ཡེ་ཤེས་ཤིན་ཏུ་གྲུབ་ཅིང་
en: utterly perfect patience, utterly perfect diligence, utterly perfect concentration, utterly perfect insight, utterly perfect means, utterly perfect aspiration, utterly perfect power, and utterly perfect wisdom.

source: ཐུན་མོང་མ་ཡིན་པའི་ཡེ་ཤེས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ལས་འདས་པ།
en: Thus, as their wisdom has been accomplished completely, it is exceptional and beyond that of all hearers and solitary buddhas.

source: ས་དང་པོ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཡན་ཆད། ས་དགུ་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་བར་གྱི་ཡེ་ཤེས་ལས་འདས་པ་དང་ལྡན་པས་ཡེ་ཤེས་ཤིན་ཏུ་རྫོགས་པ་རྣམས་ཡིན་ནོ།
en: Since it also transcends the wisdom of bodhisattvas from the first to the ninth ground, their wisdom is utterly perfect.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: Noble son, bodhisattvas endowed with ten such qualities quickly awaken to unexcelled and perfect buddhahood.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པའི་ཚེ། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྣམ་པ་དྲུག་ཏུ་རབ་ཏུ་འགུལ་ཏེ། རབ་ཏུ་གཡོས་པར་གྱུར་ཏོ།
en: When the Blessed One had given this Dharma teaching the entire great trichiliocosm trembled and shook in six different ways.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་རི་རབ་རིའི་རྒྱལ་པོ་ཆེན་པོ་དག་གམ། རི་བཏང་བཟུང་ངམ། རི་བཏང་བཟུང་ཆེན་པོ་དག་གམ། ཁོར་ཡུག་གི་རིའམ། ཁོར་ཡུག་གི་རི་ཆེན་པོ་དག་གམ། དེ་མ་ཡིན་པའི་རིན་པོ་ཆེའི་རི་དང་། རི་ནག་པོ་དེ་དག་ཐམས་ཅད་ཀྱང་
en: Mount Meru, the great majestic mountains, the Mucilinda Mountains, the Mahā­muci­linda Mountains, the surrounding mountains, and the great surrounding mountains, along with all the jewel mountains and dark mountains,

source: ཡུལ་ག་ཡ་གང་ན་བ་དང་། ག་ཡ་མགོའི་རི་གང་ན་བ་དེ་ལོགས་སུ་བཅོམ་ལྡན་འདས་ལ་ཆོས་ཀྱི་དགབ་པ་བྱ་བའི་ཕྱིར་འདུད་པར་གྱུར་ཏོ།
en: bent toward the land of Gayā and Gayā­śīrṣa Hill as a Dharma homage for the Blessed One.

source: གང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་མེ་ཏོག་གི་ཤིང་ངམ། འབྲས་བུའི་ཤིང་ངམ། སྤོས་ཀྱི་ཤིང་ཅི་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་
en: Likewise, all the flowering trees, fruit trees, and all the incense trees that existed in the entire billionfold universe

source: བཅོམ་ལྡན་འདས་ལ་ཆོས་ཀྱི་དགབ་པ་བྱ་བའི་ཕྱིར་ག་ཡ་མགོའི་རི་གང་ན་བ་དེ་ལོགས་སུ་འདུད་པར་གྱུར་ཏོ།
en: bent toward Gayā­śīrṣa Hill as a Dharma homage to the Blessed One.

source: བྱང་ཆུབ་སེམས་དཔའ་བཅོམ་ལྡན་འདས་ལ་ཆོས་ཀྱི་དགབ་པ་འབུལ་བ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མས་ཀྱང་ན་བཟའ་དང་། རྒྱན་གྱི་བྱེ་བྲག་རྣམ་པ་སྣ་ཚོགས་ཀྱི་ཕུང་པོ་རི་རབ་ཙམ་བྱས་པར་གྱུར་ཏོ།
en: As a Dharma offering to the Blessed One, the bodhisattvas presented quadrillions of garments and ornaments in a heap as large as Mount Meru.

source: བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་བརྒྱ་སྟོང་དུ་མ་ཡང་མགོ་བོས་ཕྱག་འཚལ་ཞིང་ཐལ་མོ་སྦྱར་བ་བྱས་ཏེ་འདུད་ཅིང་།
en: Śakra, Brahmā, and millions of guardians of the world prostrated, joined their palms in homage, and

source: བཅོམ་ལྡན་འདས་ལ་མེ་ཏོག་མན་དཱ་ར་བ་དང་། མན་དཱ་ར་བ་ཆེན་པོ་དག་འཐོར་བར་གྱུར་ཏོ།
en: tossed mandārava and mahāmandārava flowers in praise of the Blessed One.

source: ལྷའི་བུ་བརྒྱ་སྟོང་དུ་མ་ཡང་ནམ་མཁའི་དབྱིངས་ལ་གནས་ཏེ། གོས་གཡོབ་ཅིང་ཅ་ཅོ་དང་། ག་ཞ་བརྒྱ་སྟོང་དུ་མ་བྱེད་པར་གྱུར་ཏེ། ལྷ་རྫས་ཀྱི་མེ་ཏོག་གིས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་འཐོར་བར་གྱུར་ཅིང་།
en: Millions of gods, residing in the sky, waved streamers, laughed with joy, and made millions of joyful exclamations as they tossed divine flowers in praise of the Blessed One.

source: ཀྱེ་མའོ་དེང་ནི་འཇིག་རྟེན་དུ་སངས་རྒྱས་གཉིས་པ་སྐྱེས་པར་གྱུར་ཏེ།
en: They declared, “Ah, today a second buddha has been born in this world!

source: ཀྱེ་མའོ་ཆོས་ཀྱི་འཁོར་ལོ་གཉིས་པ་བསྐོར་ཏོ།
en: Ah, the wheel of Dharma has been turned a second time!

source: སེམས་ཅན་གང་གི་རྣ་ལམ་དུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གྲག་པར་གྱུར་པ་དེ་དག་ཀྱང་བསོད་ནམས་དང་ལྡན་ཞིང་དགེ་བའི་ལས་བྱེད་པ་སྟེ།
en: Anyone whose ears have so much as caught the sound of this Dharma teaching must be endowed with merit, must have acted virtuously, and

source: སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་དགེ་བའི་རྩ་བ་རབ་ཏུ་བསགས་པ་ཡིན་ན།
en: must have accumulated roots of virtue before thus-gone ones of the past,

source: གང་འདི་ལ་དད་པ་རྙེད་པ་དེ་དག་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་ཞེས་དེ་སྐད་ཅེས་ཆེད་དུ་རྗོད་པ་ཆེད་དུ་བརྗོད་དོ།
en: not to speak of those who have faith in it!”

source: ལྟོ་འཕྱེ་ཆེན་པོ་བརྒྱ་སྟོང་དུ་མ་ཡང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཉིད་ལ་ཆོས་ཀྱི་དགབ་པ་བྱ་བའི་ཕྱིར་འབྲུག་ལྟར་སྒྲ་འུ་རུ་རུ་འབྱིན། སྒྲོགས་པར་བྱེད་ཤིན་ཏུ་སྒྲོགས་པར་བྱེད་ཅིང་། སྤོས་ཀྱི་སྤྲིན་སྣ་ཚོགས་མངོན་པར་སྤྲུལ་ཏེ།
en: As a Dharma homage for this Dharma teaching, the mahoragas brought forth a great roaring thunder and emanated numerous clouds of incense.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དང་། ག་ཡ་མགོའི་རི་ལ་སྤོས་ཆུའི་ཆར་མངོན་པར་འབེབས་ཀྱང་སེམས་ཅན་རྣམས་ལ་གནོད་པར་མི་སྣང་ངོ་།
en: Without any harm occurring to sentient beings, they let a great fragrant rain fall on the entire trichiliocosm and on Gayā­śīrṣa Hill.

source: ཀླུའི་བུ་མོ་བརྒྱ་སྟོང་དུ་མ་ཡང་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཀླུའི་ང་རོའི་སྒྲ་འབྱིན་པར་གྱུར་ཏོ།
en: Before the Blessed One, millions of nāga girls burst out with their nāga cries.

source: དྲི་ཟ་དང་མི་འམ་ཅི་བརྒྱ་སྟོང་དུ་མ་ཡང་སྙན་ཅིང་ཟབ་པའི་དབྱངས་ཀྱིས་གླུ་ལེན་ཅིང་
en: Hundreds of thousands of gandharvas and kinnaras sang melodious and profound songs,

source: ག་ཡ་མགོའི་རི་དང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ལ་སྐོར་བ་བྱེད་པར་གྱུར་ཏོ།
en: as they circumambulated Gayā­śīrṣa Hill and the trichiliocosm.

source: གནོད་སྦྱིན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་ཡང་པད་མའི་ཆར་མངོན་པར་འབེབས་པར་གྱུར་ཏོ།
en: Many hundred thousand quadrillions of yakṣas let a rain of flowers fall.

source: བྲམ་ཟེ་དང་། རྒྱལ་རིགས་དང་། གྲོང་པ་དང་། ཡུལ་གྱི་མི་བརྒྱ་སྟོང་དུ་མ་ཡང་
en: Many hundred thousand brahmins, members of the royalty, townspeople, and country dwellers

source: མེ་ཏོག་དང་། བདུག་སྤོས་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱེད་པར་གྱུར་ཏོ།
en: brought forth offerings to the Blessed One of flowers, incense, perfume, garlands, ointments, powders, garments, parasols, victory banners, and standards.

source: སངས་རྒྱས་ཀྱི་ཞིང་དུ་མ་དག་ནས་ཀྱང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ཆོས་ཀྱི་དགབ་པ་བྱ་བའི་ཕྱིར་སོ་སོའི་སྨིན་མཚམས་ཀྱི་མཛོད་སྤུ་དག་ནས་འོད་ཟེར་མང་པོ་བཀྱེ་བར་གྱུར་ཏེ།
en: As a Dharma homage, blessed buddhas residing in numerous buddha realms projected numerous light rays from the hair between their eyebrows.

source: འོད་ཟེར་དེ་དག་ཀྱང་ཁ་དོག་སྣ་ཚོགས། གཟུགས་སྣ་ཚོགས། སྣང་བ་སྣ་ཚོགས་ཅན་ཤ་སྟག་སྟེ།
en: The light was multicolored, taking on all sorts of forms and appearances.

source: འདི་ལྟ་སྟེ། སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། ལེ་བརྒན་དང་། ཤེལ་དང་། དངུལ་གྱི་ཁ་དོག་སྟེ།
en: There were colors of blue, yellow, red, white, violet, crystal, and silver,

source: དེ་དག་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ལ་སྐོར་བ་བྱེད་ཅིང་མུན་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བར་གྱུར་ཏེ།
en: the light rays circled around the trichiliocosm, dispelling all darkness.

source: འཁོར་ནས་ག་ཡ་མགོའི་རི་ལ་བསྐོར་བ་བྱས། དེ་བཞིན་གཤེགས་པ་ལ་ཡང་བསྐོར་བ་བྱས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་ཏུ་ནུབ་པར་གྱུར་ཏོ།
en: The light then streamed to Gayā­śīrṣa, where it first circled the mountain, then the Blessed One, and finally it dissolved into his uṣṇīṣa.

source: རླུང་ཡང་བདེ་བར་ལངས་པར་གྱུར་ཏོ།
en: At that point a delightful breeze was felt.

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་དང་། མཆོད་པ་མངོན་པར་འདུ་བྱ་བ་འདི་བྱུང་བའི་ཚེ།
en: When this Dharma teaching was delivered, and all these offerings presented,

source: བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་བདུན་ཅུ་རྩ་གཉིས་ཀྱིས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ།
en: seventy-two quadrillion bodhisattvas gained acceptance that phenomena are nonarising,

source: སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་ཡང་ཆོས་རྣམས་ལ་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་ཆོས་ཀྱི་མིག་རྣམ་པར་དག་གོ།
en: millions of beings gained the immaculate and stainless Dharma eye with regard to phenomena,

source: སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མས་ཀྱང་སྔོན་ཆད་མ་བསྐྱེད་པ་ལས་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་གྱུར་ཏོ།
en: millions of living beings, who had not previously done so, gave rise to the mind of awakening.

source: དེ་ནས་ག་ཡ་མགོའི་རི་ལ་གནས་པའི་ལྷ་མོ་མི་འཆི་བ་ཞེས་བྱ་བ་
en: The goddess known as A­martyā resides at Gayā­śīrṣa.

source: དཔུང་དང་བཅས་འཁོར་དང་བཅས་ཏེ་འཁོར་འདུས་པ་དེ་ཉིད་དུ་འདུས་ཤིང་འདུག་འདུག་པ་ལས་དེ་སྟན་ལས་ལངས་ནས་བདག་གི་གནས་སུ་སོང་སྟེ།
en: Along with her army and retinue she had been present in the gathered assembly, but now she rose up to leave for her home.

source: བཅོམ་ལྡན་འདས་ཀྱི་མཆོད་པ་བླངས་ནས། ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཕྱིན་ཏེ།
en: She took up offerings for the Blessed One, and went before him.

source: བཅོམ་ལྡན་འདས་ལ་བཀུར་སྟི་བྱས། བཙུན་པ་བྱས། རི་མོ་བྱས། མཆོད་པ་བྱས། བསྟི་སྟང་བྱས། རིམ་གྲོ་བྱས་སོ།
en: She paid respect, worshiped him, venerated him, made offerings, and performed acts of reverence.

source: བྱས་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: When she had finished, she addressed him:

source: བཅོམ་ལྡན་འདས་ཚེ་རབས་གཞན་དེ་དང་དེ་དག་ལ་ག་ཡ་མགོའི་རི་འདི་ཉིད་དུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སངས་རྒྱས་སྟོང་ཕྲག་བདུན་ཅུ་རྩ་གཉིས་ཀྱིས་དོན་འདི་ཉིད་དག་དང་། ཚུལ་འདི་ཉིད་དག་དང་། ཚིག་དང་ཡི་གེ་འདི་ཉིད་དག་གིས་བསྟན་པ་བདག་གིས་མངོན་པར་དྲན་ནོ།
en: “Blessed One, I recall from other lives that seventy-two thousand buddhas have delivered this Dharma teaching here at Gayā­śīrṣa, with the exact same meaning, in the exact same way, and with the exact same words and syllables.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མི་འཆི་བ་
en: “A­martyā,” replied the Blessed One,

source: དེ་ལྟར་ཁྱོད་ཀྱིས་དཀོན་མཆོག་འབྱུང་བ་དེ་ལྟ་བུ་ཐོས་པར་གྱུར་པ་ནི་ཁྱོད་ཀྱིས་ཐོབ་པར་བྱ་བ་ལེགས་པར་ཐོབ་བོ།
en: “as you have thus listened to what is precious, you have accomplished well that which one must attain.”

source: དེ་ནས་འཁོར་དེར་ཚོགས་པའི་ནང་ན་ལྷའི་བུ་ཁ་ཅིག་འདི་སྙམ་དུ་སེམས་པར་གྱུར་ཏེ།
en: Some gods who were present in the gathering then thought,

source: ལྷ་མོ་འདིས་དེ་སྲིད་ཅིག་ནས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་ནས་དེ་སྙེད་ཀྱི་དེ་བཞིན་གཤེགས་པ་མང་པོ་ལ་བསྙེན་བཀུར་བྱས་ཀྱང་། འདིས་བུད་མེད་ཀྱི་ལུས་ལས་མ་བསྒྱུར་སྙམ་པ་དང་།
en: “How can it be that this goddess has heard this Dharma teaching so many times and served that many thus-gone ones, and still she has but a female body?”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བས། ལྷའི་བུ་དེ་དག་གི་སེམས་ཀྱི་རྟོག་པ་སེམས་ཀྱིས་ཡོངས་སུ་ཤེས་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: The bodhisattva great being Sarva­nīvaraṇa­viṣkam­bhin was aware of the thoughts of those gods, and so he addressed the Blessed One:

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་ལྷ་མོ་མི་འཆི་བ་འདིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལྟར་རྫུ་འཕྲུལ་ཆེ་བ་ཐོབ་ལ། དེ་བཞིན་གཤེགས་པ་དེ་སྙེད་དུ་མང་བ་ཞིག་བསྙེན་བཀུར་བགྱིས་ན།
en: “Blessed One, the goddess A­martyā has previously received this Dharma teaching, which is endowed with great miraculous powers, and she has served so many thus-gone ones.

source: ཅིའི་རྒྱུ་ཅིའི་རྐྱེན་གྱིས་འདིས་བུད་མེད་ཀྱི་ལུས་ལས་མ་བསྒྱུར།
en: So what are the causes and conditions that she still has but a female body?”

source: འདི་ལ་སེམས་ཅན་གྱི་དོན་ནི་རྒྱུའོ། །སེམས་ཅན་གྱི་དོན་ནི་རྐྱེན་ཏོ།
en: “the welfare of sentient beings is the cause and the welfare of sentient beings is the condition.

source: རིགས་ཀྱི་བུ་ལྷ་མོ་མི་འཆི་བ་ནི་རྣམ་པར་ཐར་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་གནས་པ། རྫུ་འཕྲུལ་ཆེ་བ། མཐུ་ཆེ་བ་སྟེ།
en: Noble son, the goddess A­martyā abides within inconceivable liberation, and she possesses great and miraculous powers.

source: རིགས་ཀྱི་བུ་ལྷ་མོ་མི་འཆི་བས་གང་ཡང་དག་པར་ལེན་དུ་བཙུད་པ་དང་། གཟེངས་བསྟོད་པ་དང་། བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ལས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་སངས་རྒྱས་ནི་བགྲང་བ་ལས་འདས་པ་ཞིག་ངས་མངོན་པར་ཤེས་ཏེ།
en: Noble son, I know that there are innumerably many buddhas who have now passed beyond suffering whom the goddess A­martyā inspired, encouraged, and caused to arouse the mind of awakening.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་ལྷ་མོ་མི་འཆི་བ་ནི་རྫུ་འཕྲུལ་ཆེ་བ། མཐུ་ཆེ་བ་སྟེ།
en: Noble son, the goddess A­martyā possesses great and miraculous powers.

source: རིགས་ཀྱི་བུ་ལྷ་མོ་མི་འཆི་བ་འདི་ནི་བསྐལ་པ་བཟང་པོའི་སངས་རྒྱས་རྣམས་ལ་བསྙེན་བཀུར་བྱས་ནས། སངས་རྒྱས་ཀྱི་ཞིང་འདི་ཉིད་དུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: Noble son, having served the buddhas of this excellent eon, the good A­martyā will attain perfect buddhahood within this very buddha realm.

source: མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཀྱང་མི་འཆི་བ་ཞེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་འགྱུར་རོ།
en: Upon her attainment of perfect buddhahood she will become known as the Thus-Gone One, the blessed, worthy, perfect buddha A­martyā.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷ་མོ་མི་འཆི་བ་ལ་བཀའ་སྩལ་པ།
en: The Blessed One then turned to the goddess A­martyā.

source: མི་འཆི་བ་ཁྱོད་ཀྱིས་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་སྟོན་ཅིག
en: “A­martyā, reveal your buddha realm.”

source: དེ་ནས་ལྷ་མོ་མི་འཆི་བ་གཟུགས་ཐམས་ཅད་ཡོངས་སུ་སྟོན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་པར་གྱུར་ཏེ།
en: The goddess A­martyā then entered the absorption known as displaying all forms

source: ལྷ་མོ་མི་འཆི་བ་གཟུགས་ཐམས་ཅད་ཡོངས་སུ་སྟོན་པའི་ཏིང་ངེ་འཛིན་དེ་ལ་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ་དེའི་ཚེ། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ལག་མཐིལ་ལྟ་བུར་མཉམ་ཞིང་བཻ་དཱུརྱའི་གཞིར་སྣང་བར་གྱུར་ཏེ།
en: As soon as the goddess entered that absorption, the great trichiliocosm became as even as the palm of a hand, with a ground made of beryl.

source: རི་ནག་པོ་མེད་ཅིང་ཤིང་ཐ་མལ་པ་མེད་ལ།
en: There were no dark mountains, nor any ordinary trees.

source: གནས་གནས་དག་ན་ཡང་དཔག་བསམ་གྱི་ཤིང་ཤ་སྟག་སྣང་བར་གྱུར་ཏོ།
en: Since the whole environment became pure, there now appeared nothing but wish-fulfilling trees.

source: གནས་གནས་དག་ན་ཆུ་མིག་དང་། མཚེའུ་དང་། ལྟེང་ཀ་དང་། རྫིང་ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་ཆུས་ཡོངས་སུ་གང་བ་དག་སྣང་བར་གྱུར་ཏོ།
en: In that pure environment there were springs, ponds, pools, and reservoirs brimming with water of the eight qualities.

source: མི་ཕལ་པ་མེད་པར་སྣང་བར་གྱུར་ཏོ། །དེ་ན་བུད་མེད་ཀྱི་སྒྲ་ཡང་མི་གྲག་པར་གྱུར་ཏོ།
en: No ordinary humans were seen, and even the word woman was unheard of.

source: གནས་དང་གནས་དག་ན་པད་མ་ཤིང་རྟའི་འཁོར་ལོ་ཙམ་དག་སྣང་བར་གྱུར་ཏེ།
en: In that pure environment lotus flowers the size of chariot wheels grew,

source: པད་མ་དེ་དག་ལ་ཡང་བྱང་ཆུབ་སེམས་དཔའི་གཟུགས་སྐྱིལ་མོ་ཀྲུང་དུ་འཁོད་པ་ཤ་སྟག་སྣང་བར་གྱུར་ཏོ།
en: within each of them appeared bodhisattvas, seated in cross-legged posture.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མི་འཆི་བ་དེ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་ཆོས་སྟོན་པར་སྣང་སྟེ།
en: The Blessed One, the thus-gone, worthy, perfect buddha A­martyā was teaching the Dharma to all these bodhisattvas.

source: བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མས་ཡོངས་སུ་བསྐོར་ཅིང་
en: This buddha appeared surrounded by Śakra, Brahmā, and many quadrillions of the guardians of the world.

source: བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མས་མདུན་དུ་བདར་ཏེ། འདི་ལྟར་ཆོས་ཉིད་འདི་ཁོ་ན་བརྩམས་ནས་ཆོས་སྟོན་པར་སྣང་བར་གྱུར་ཏོ།
en: Beseeched by many quadrillions of bodhisattvas, this buddha taught the Dharma exclusively from the perspective of the intrinsic nature.

source: དེ་ནས་ལྷ་མོ་མི་འཆི་བ་ཡང་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ཏེ། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་དུ་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་དེ་ཉིད་དུ་མི་སྣང་བར་གྱུར་ཏོ།
en: Then the goddess A­martyā emerged from her absorption, circumambulated the Blessed One three times to the right, and disappeared.

source: བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོ་གང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཉན་ཏམ། འཛིན་ཏམ། འཆང་ངམ། ཀློག་གམ། ཀུན་ཆུབ་པར་བགྱིད་དམ། ཁ་ཏོན་བགྱིད་དམ། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་སྟོན་པར་བགྱིད་ན། དེ་བསོད་ནམས་ཇི་ཙམ་ཞིག་སྐྱེད་པར་འགྱུར།
en: “How much merit, Blessed One, will a noble son or daughter give rise to by listening to, memorizing, upholding, reading, mastering, reciting, and delivering this Dharma teaching widely to others?”

source: རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་གཏོགས་པའི་སེམས་ཅན་རྣམས་ལ་སྦྱིན་པ་ལྷུག་པར་བྱིན་ཏེ།
en: “Compared to the merit of a noble son or daughter, who for millions of eons is greatly generous to all beings of this trichiliocosm,

source: དེ་ལྟར་སྦྱིན་པས་བསྐལ་པ་བརྒྱ་སྟོང་མང་པོར་བྱིན་པ་བས། རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལེགས་པར་བྲིས་ལེགས་པར་ཞུས་ཏེ། སེམས་དད་པས་སེམས་དད་པ་ལ་བྱིན་ན། དེ་བས་ཀྱང་འདི་བསོད་ནམས་ཆེས་མང་དུ་སྐྱེད་དོ།
en: the merit of a noble son or daughter who accurately writes down this Dharma teaching, receives it properly, and engages with it through faith will be far more abundant.

source: ཟང་ཟིང་གི་སྦྱིན་པ་ནི་ཕྲན་ཚེགས་ཏེ། ཆོས་ཀྱི་སྦྱིན་པ་ནི་རྫུ་འཕྲུལ་ཆེ་བའོ།
en: Generosity with material things is insignificant, whereas generosity with the Dharma possesses great miraculous power.

source: རིགས་ཀྱི་བུ་འཁོར་བ་ན་འཁོར་བའི་སེམས་ཅན་རྣམས་ཀྱིས་ཟང་ཟིང་ནི་རྣམ་པ་དུ་མར་མྱོང་གི
en: noble son, while sentient beings revolving within cyclic existence have abundant experience with material things,

source: འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་ཀྱི་རོ་ནི་ནམ་ཡང་མ་མྱོང་སྟེ།
en: they have never experienced the taste of the Dharma that is beyond the world.

source: འཇིག་རྟེན་པ་ནི་མ་ཡིན་ནོ།
en: The Dharma is not of the world.

source: རིགས་ཀྱི་བུ་གང་ལ་ལས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་གཏོགས་པའི་སེམས་ཅན་རྣམས་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་ལ་བཀོད་པ་བས།
en: “A noble son or daughter may establish all beings in the trichiliocosm upon the paths of the ten virtuous acts.

source: གང་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཉན་ཏམ། འཛིན་ཏམ། འཆང་ངམ། ཀློག་གམ། ཀུན་ཆུབ་པར་བྱེད་དམ། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་སྟོན་ན། དེ་བས་འདི་བསོད་ནམས་ཆེས་མང་དུ་སྐྱེད་དོ།
en: Yet there is far more merit in listening to, retaining, holding, reading, mastering, and explaining widely to others this teaching of the Dharma.

source: དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་ནི་འདི་ལས་བྱུང་ངོ་།
en: the paths of the ten virtuous acts emerge from this.

source: རིགས་ཀྱི་བུ་གང་ལ་ལ་ཞིག་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་གཏོགས་པའི་སེམས་ཅན་རྣམས་རྒྱུན་དུ་ཞུགས་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་ཉིད་ཀྱི་འབྲས་བུ་ལ་བཀོད་པ་
en: “A noble son or daughter may establish all beings in the trichiliocosm within the fruitions of a stream-enterer, once-returner, non-returner, and worthy one.

source: འདི་ཉིད་ལ་བརྟེན་ན། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་སྣང་བར་འགྱུར་རོ། །ཆོས་འདི་ཉིད་ལ་བརྟེན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སྣང་བར་འགྱུར་རོ། །ཆོས་འདི་ཉིད་ལ་བརྟེན་ན་དེ་བཞིན་གཤེགས་པ་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་ཏེ།
en: the hearers and solitary buddhas appear through reliance on this very Dharma, the bodhisattvas appear through reliance on this very Dharma, and the thus-gone ones will manifest in the world through reliance on this very Dharma.

source: རིགས་ཀྱི་བུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གཟུང་བ་དང་། བཀླག་པ་དང་། སྤེལ་བ་དང་། ཁ་ཏོན་བྱས་པས་མདོ་སྡེ་ཐམས་ཅད་གཟུང་བ་དང་། བཀླག་པ་དང་། སྤེལ་བ་དང་། ཁ་ཏོན་བྱས་པར་འགྱུར་རོ།
en: “Noble son, retaining, reading, copying, and reciting this Dharma teaching is to retain, read, copy, and recite all discourses.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། རིགས་ཀྱི་བུ་འདི་ནི་ཆོས་ཐམས་ཅད་ཀྱི་མ་མོ་སྟེ།
en: How so? Because, noble son, this is the mother of all Dharma.

source: རིགས་ཀྱི་བུ་ཆོས་ཉིད་འདི་མ་ཐོབ་པར་ཆོས་ཉིད་རྒྱ་ཆེན་པོ་འཐོབ་པར་མི་འགྱུར་ཏེ།
en: Noble son, without attaining the intrinsic nature of this teaching, one will not attain the vast intrinsic nature.

source: རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་འདུལ་བའོ།
en: Noble son, this is the discipline of the bodhisattvas.”

source: དེ་ནས་སངས་རྒྱས་ཀྱི་མཐུས་ཉན་ཐོས་ཆེན་པོ་དེ་དག་ཐམས་ཅད་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ཏེ།
en: Then, by the power of the Buddha, all the great hearers who were present in the gathering rose from their seats and draped their Dharma robes over one shoulder.
